package courses_java_Advanced.x_8_ThreadRunnableProblemsWithThreads;

public class Main {
    public static void main(String[] args) {



        /*
        Задание 1
        В любой из профильных книг (Хорстман, Эккель) найти соответствующие темы и закрепить материал.
        Использование YouTube, Quizful приветствуется.
        */
        System.out.println("Задание 1");
        System.out.println("-------------------------------------");

        /*
        Задание 2
        Задержка потока. Необходимо создать 3 потока, каждых из этих потоков запустить (например: main, second, first),
        и когда эти потоки успешно отработают – вывести на экран сообщение (завершение потом first, second и main).
        */
        System.out.println("Задание 2");
        System.out.println("-------------------------------------");

        /*
        Задание 3
        Демонстрация приоритетов. Создать 2 класса PriorityRunner и PriorityThread.
        Запустить 3 потока с приоритетами (min, max, norm).
        При помощи цикла for выведем на экран значения от 1 до 50 и укажем, какой именно поток данную операцию делает.
        */
        System.out.println("Задание 3");
        System.out.println("-------------------------------------");


        /*
        Задание 4
        Создать 2 произвольных класса с полями и методами.
        Необходимо синхронизировать методы этих классов между собой,
        т.е. чтобы выводило на экран значения друг за другом (1 класс, 2 класс, 1, 2 и т.д.).
        */
        System.out.println("Задание 4");
        System.out.println("-------------------------------------");

        /*
        Задание 5
        В любой из профильных книг (Хорстман, Эккель) найти соответствующие темы и закрепить материал.
        Использование YouTube, Quizful приветствуется.
        */
        System.out.println("Задание 5");
        System.out.println("-------------------------------------");


        /*
        Задание 6
        Создать 2 класса. Реализовать взаимную блокировку(deadlock) этих классов.
        */
        System.out.println("Задание 6");
        System.out.println("-------------------------------------");

        /*
        Задание 7
        Изменить задание №6. Всеми возможными способами (которые Вы знаете) решить проблему взаимной блокировки.
        */
        System.out.println("Задание 7");
        System.out.println("-------------------------------------");


    }
}
