package courses_java_Advanced.x_5_Reflection;

public class Main {
    public static void main(String[] args) {


        /*
        Задание 1
        В любой из профильных книг (Хорстман, Эккель) найти соответствующие темы и закрепить материал.
        Использование YouTube, Quizful приветствуется.
        */
        System.out.println("Задание 1");
        System.out.println("-------------------------------------");

        /*
        Задание 2
        Напишите программу, которая будет выводить всю информацию о классе, пользователь сам выбирает, какой именно класс интересует.
        */
        System.out.println("Задание 2");
        System.out.println("-------------------------------------");


        /*
        Задание 3
        Создайте класс, в нем определите 3 поля, к этим полям создайте конструкторы и методы.
        Под средством рефлексии получите всю информацию о полях, методах, конструкторах, а также модификаторах доступа.
        */
        System.out.println("Задание 3");
        System.out.println("-------------------------------------");

        /*
        Задание 4
        Создайте 2 класса, Animal и Cat. В классе Animal инициализируйте 3 поля различных модификаторов.
        В классе Cat используя рефлексию получите доступ к полям класса Animal и измените содержимое каждого из полей.
        */
        System.out.println("Задание 4");
        System.out.println("-------------------------------------");

    }
}
