package courses_java_Advanced.x_7_SerializationXML_JSON;

public class Main {
    public static void main(String[] args) {


        /*
        Задание 1
        В любой из профильных книг (Хорстман, Эккель) найти соответствующие темы и закрепить материал.
        Использование YouTube, Quizful приветствуется.
        */
        System.out.println("Задание 1");
        System.out.println("-------------------------------------");

        /*
        Задание 2
        Необходимо осуществить десериализацию с файла предыдущего проекта(Animal) и вывести на экран содержимое.
        */
        System.out.println("Задание 2");
        System.out.println("-------------------------------------");

        /*
        Задание 3
        Создайте класс, используя SAXParser, в котором опишите иерархию XML файла.
        Необходимо, чтобы проект создавал XML файл и строил дерево (город, название улицы, дом).
        В городе используйте аттрибут(например, <city size=”big>Kiev</city>).
        */
        System.out.println("Задание 3");
        System.out.println("-------------------------------------");

        /*
        Задание 4
        Используя JAXB выполнить задание №3.
        */
        System.out.println("Задание 4");
        System.out.println("-------------------------------------");

        /*
        Задание 5
        ·         Что такое Сериализация/десериализация?
        ·         Что такое Маршаллинг/демаршаллинг?
        ·         Расскажите про XML, в чем разница между HTML?
        ·         Какие парсеры в XML знаете?
        ·         Что делает JSON?
        ·         Что такое JAXB?
        */
        System.out.println("Задание 5");
        System.out.println("-------------------------------------");


    }
}
