package courses_java_Advanced.x_3_IO_Strings;

public class Main {
    public static void main(String[] args) {



        /*
        Задание 1
        В любой из профильных книг (Хорстман, Эккель) найти соответствующие темы и закрепить материал.
        Использование YouTube , Quizful приветствуется.
        */
        System.out.println("Задание 1");
        System.out.println("-------------------------------------");

        /*
        Задание 2
        Создайте файл, запишите в него произвольные данные и закройте файл.
        Затем снова откройте этот файл, прочтите из него данные и выведите их на консоль.
        */
        System.out.println("Задание 2");
        System.out.println("-------------------------------------");

        /*
        Задание 3
        Нужно сделать строку с текстом (текст взять хоть какой из веба).
        Разбить эту строку на 2 подстроки равной длине и вывести на экран каждое предложение с новой строки.
        */
        System.out.println("Задание 3");
        System.out.println("-------------------------------------");


        /*
        Задание 4
        Создайте в package текстовый файл и класс , внесите в файл какой-нибудь текст.
        Выведите на экран содержимое файла.
        */
        System.out.println("Задание 4");
        System.out.println("-------------------------------------");


    }
}
