package courses_java_Bases.x_5_Lists;

public class Main {
    public static void main(String[] args) {


/*
Задание 1
В любой из профильных книг (Хорстман, Эккель) найти соответствующие темы и закрепить материал. Использование YouTube, Quizful приветствуется.
*/



/*
Задание 2
Используя Intelij IDEA создать проект, пакет. Создать класс Zoo. В классе создать список, в который записать 8 животных через метод add(index, element). Вывести список в консоль.
*/



/*
Задание 3
Используя Intelij IDEA создать проект, пакет. Используя класс Zoo Задания 2, удалить 3, 5, 7 животные, узнать размер списка и вывести в консоль.
*/



/*
Задание 4
Используя Intelij IDEA создать проект.
*/


/*
Задание 5
Используя Intelij IDEA создать проект, пакет. Создать class Main, в нем создать список, добавить учителей, которых вы только сможете вспомнить со школы. И получить индекс самого лучшего учителя и самого не очень. Вывести список в консоль.
*/




    }
}
