package courses_java_Advanced.x_9_LambdaExpressions;

public class Main {
    public static void main(String[] args) {


        /*
        Задание 1
        В любой из профильных книг (Хорстман, Эккель) найти соответствующие темы и закрепить материал.
        Использование YouTube, Quizful приветствуется.
        */
        System.out.println("Задание 1");
        System.out.println("-------------------------------------");

        /*
        Задание 2
        Создать список и заполнить рандомными числами 10 ячеек, нужно вывести сумму квадратов всех элемента списка.
        Мы используем метод map() для возведения в квадрат каждого элемента,
        а потом применяем метод reduce() для свертки всех элементов в одно число.
        */
        System.out.println("Задание 2");
        System.out.println("-------------------------------------");


        /*
        Задание 3
        Создать класс Book, сделать 3 поля и соответствующие методы.
        Необходимо реализовать замыкание анонимного класса и лямбда-выражения
        */
        System.out.println("Задание 3");
        System.out.println("-------------------------------------");


        /*
        Задание 4
        Напишите основные арифметические действия калькулятора используя лямбда-выражения
        */
        System.out.println("Задание 4");
        System.out.println("-------------------------------------");
    }
}
