package courses_java_BlackJack.test;

public class Test27_12_21 {

/*
Задача со звёздочкой

Написать игру блекджек (21)

Создайте следующие классы.

Class Card
{ String suit, int rank, конструктор -get -set и. метод toString}

Class Deck
{ ArrayList<Card> deck, конструктор для колоды из 52 карт (по рубашкам и номерам),
метод перемешивания карт в колоде, метод, который возвращает 1 карту из колоды и убегает ее)

Class PlayerHand
{ArrayList<Card> cards,
метод getCard который добавляет карты в список
метод getSum который отвечает за сумму очков (карты от 2-10 = соответствующее количество очков, карты 11-13 = +10 очков,
карта джокер = +11, если сумма 22 (два джокера) = -10 очков
метод проверки выпал ли блэкджек (если в руках джокер и карта рангом 11-13)}

Class BlackJack
{создаем колоду, перемешиваем, выдаем игроку 2 карты и выводим их сумму очков, если сумма < 21,
спрашиваем выдать ли еще карту, если да, то выводим новую карту и сумму очков,
повторяем процесс пока сумма очков не будет >=21, или пока игрок не перестанет брать карты.
В конце выводим сумму очков. Дилер (компьютер) также получает карты, получает дополнительную карту пока сумма очков его карт < 15.
В конце выводится победитель. Победитель тот, у кого очков больше ближе к 21, если очков больше 21 игра проиграна. }

*/
}
