package courses_java_Bases.x_9_Generics;

public class Main {
    public static void main(String[] args) {

        /*
        Задание 1
        Выучите основные конструкции и понятия, рассмотренные на уроке.
        */


        /*
        Задание 2
        Создайте проект, используя IntelliJ IDEA.
        Создайте класс MyList.
        Реализуйте в простейшем приближении возможность использования его экземпляра аналогично экземпляру класса List.
        Минимально требуемый интерфейс взаимодействия с экземпляром, должен включать метод добавления элемента,
        индексатор для получения значения элемента по указанному индексу и свойство только
        для чтения для получения общего количества элементов.
        */

        /*
        Задание 3
        Создайте проект, используя IntelliJ IDEA.
        Создайте класс MyDictionary. Реализуйте в простейшем приближении возможность использования его экземпляра.
        Минимально требуемый интерфейс взаимодействия с экземпляром, должен включать метод добавления пар элементов,
        индексатор для получения значения элемента по указанному индексу и свойство только для чтения для получения общего количества пар элементов.
        */

        /*
        Задание 4
        Зайдите на сайт Oracle.
        Используя поисковые механизмы Oracle, найдите самостоятельно описание темы по каждому примеру,
        который был рассмотрен на уроке, так, как это представлено ниже, в разделе «Рекомендуемые ресурсы», описания данного урока.
        Сохраните ссылки и дайте им короткое описание.
        */


        /*
        Задание 5
        Создайте проект, используя IntelliJ IDEA. Создайте класс MyClass, содержащий статический фабричный метод - T factoryMethod(), который будет порождать экземпляры типа, указанного в качестве параметра типа (указателя места заполнения типом – Т).
        */


    }
}
